[
  {
    "id": "Development",
    "1": "Built and delivered modern, scalable front-end applications for enterprise dashboards and e-commerce products using advanced technologies including React (TypeScript), Svelte, Next.js, and UI frameworks like Ant Design, Material UI, and Tailwind CSS. Major projects include Gokwik Merchant Dashboard, Gokwik Checkout, and Mint Dashboard.",
    "2": "Transformed complex business and merchant requirements into highly interactive, performant web experiences through component-based architecture, responsive design, and optimization for performance and usability.",
    "3": "Pioneered automation initiatives, developing browser-based tools and custom automation apps to streamline workflows, automate integration testing, and reduce manual effort (e.g., CustomAPP Automation using Selenium, Python, and Chromium Driver Manager).",
    "4": "Architected and maintained interactive, API-driven documentation portals such as SIMPL Documentation and SafexPay, leveraging Docusaurus, Swagger UI, React, and backend integration with Python and Node.js.",
    "5": "Designed and managed plugin systems and third-party integrations for platforms like WooCommerce, Magento, and WordPress, delivering tailored payment and dashboard experiences and ensuring seamless merchant onboarding.",
    "6": "Led end-to-end delivery of personal and client web projects, managing everything from wireframing and UI prototyping to deployment, and contributed to both private enterprise codebases and public open-source utilities."
  },
  {
    "id": "Technical Support",
    "1": "Diagnosed, debugged, and resolved complex frontend, API, and integration issues across multiple platforms using tools like Postman, JIRA, and browser-based debugging suites.",
    "2": "Provided technical consultation and best-practice recommendations to cross-functional teams and merchants on integration approaches, UI/UX enhancements, and SDK usage.",
    "3": "Regularly utilized API testing and collaboration tools (e.g., Postman, New Relic) for RESTful service validation and troubleshooting.",
    "4": "Collaborated closely with product managers, QA, and backend engineers to review feature designs, collect feedback, and deliver timely product enhancements.",
    "5": "Offered hands-on assistance for direct merchant integrations as well as plugin deployment and configuration."
  },
  {
    "id": "Extra's",
    "1": "Authored, revised, and optimized technical documentation (API guides, SDK usage, operational workflows) for both internal teams and merchant developers to facilitate smooth onboarding.",
    "2": "Served as a bridge between sales managers, product managers, and external stakeholders—ensuring alignment and transparency in technical discussions and deliverables.",
    "3": "Ideated, proposed, and implemented process optimizations and automation initiatives to accelerate key workflows and minimize repetitive manual tasks.",
    "4": "Applied in-depth payment gateway knowledge to accurately interpret merchant requirements and translate them into actionable solutions for both internal development and client success.",
    "5": "Proactively assisted with a variety of internal development assignments as needed, demonstrating adaptability and initiative."
  }
]
